# cSpell:ignoreRegExp /".*"/
# ignore strings

tap "aiotter/htop-vim"
tap "nikitabobko/tap"
tap "samtay/tui"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Multi-shell multi-command argument completer
brew "carapace"
# Emacs dependency management
brew "cask"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Render markdown on the CLI
brew "glow"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# NCurses Disk Usage,, show what takes how much space in current directory
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Search tool like grep and The Silver Searcher, better grep
brew "ripgrep"
# Intuitive find & replace CLI, better sed
brew "sd"
# Autoformat shell script source code
brew "shfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca), draw text with characters
brew "toilet"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Tree command, improved
brew "tre-command"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pager/text based browser
brew "w3m"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja", args: ["HEAD"]
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster, better cd
brew "zoxide"
# Auto-close and delete matching delimiters in zsh
brew "zsh-autopair"
# htop with vim keybindings
brew "aiotter/htop-vim/htop-vim", args: ["HEAD"]
# Tetris in your terminal
brew "samtay/tui/tetris"


# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# 2D game framework for Lua
cask "love"
# Utility to extend trackpad functionality
cask "middleclick"
# Set of tools to create, alter and inspect Matroska files (MKV)
cask "mkvtoolnix-app"
# Tool to create native applications from command-line scripts
cask "platypus"
# Quicklook extension for source files
cask "syntax-highlight"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"

# Fonts
cask "font-arimo-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-color-emoji"
cask "font-open-dyslexic-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-symbols-only-nerd-font"


# vscode extensions
vscode "alefragnani.bookmarks"
vscode "bitwes.gut-extension"
vscode "chaitanyashahare.lazygit"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.code-runner"
vscode "geequlim.godot-tools"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "jock.svg"
vscode "keploy.keployio"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.mono-debug"
vscode "openai.chatgpt"
vscode "rebornix.toggle"
vscode "rust-lang.rust-analyzer"
vscode "ryuta46.multi-command"
vscode "streetsidesoftware.code-spell-checker"
vscode "tabnine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
